package ua.butsai.homework5;

/**
 * Напишите программу для вычисления указанного выражения и распечатайте вывод.
 *  ((25.5 * 3.5 - 3.5 * 3.5) / (40.5 - 4.5))
 *
 * Ожидаемый вывод в консоле:
 *  2.138888888888889
 */
public class ExpressionCalculations {
   public static void main(String[] args){
         double d =  ((25.5 * 3.5 - 3.5 * 3.5) / (40.5 - 4.5));
      System.out.println(d);
   }
}
