package ua.butsai.homework5;

/**
 * 1) Напишите программу для печати результата следующих операций.
 *  a) -5 + 8 * 6
 *  b) (55 + 9) % 9
 *  c) 20 + -3 * 5 / 8
 *  d) 5 + 15 / 3 * 2 - 8 % 3
 *  e) ((25.5 * 3.5 - 3.5 * 3.5) / (40.5 - 4.5))
 *
 * Ожидаемый вывод в консоле:
 *  -5 + 8 * 6 = 43
 *  (55 + 9) % 9 = 1
 *  20 + -3 * 5 / 8 = 19
 *  5 + 15 / 3 * 2 - 8 % 3 = 13
 *  ((25.5 * 3.5 - 3.5 * 3.5) / (40.5 - 4.5)) = 2.138888888888889
 */
public class Result {
    public static void main(String[] args){

        int a = -5 + 8 * 6;
        int b = (55 + 9) % 9;
        int c = 20 + -3 * 5 / 8;
        int d = 5 + 15 / 3 * 2 - 8 % 3;
        double e = ((25.5 * 3.5 - 3.5 * 3.5) / (40.5 - 4.5));

        System.out.println("-5 + 8 * 6 = " + a);
        System.out.println("(55 + 9) % 9 = " + b);
        System.out.println("20 + -3 * 5 / 8 = " + c);
        System.out.println("5 + 15 / 3 * 2 - 8 % 3 = " + d);
        System.out.println("((25.5 * 3.5 - 3.5 * 3.5) / (40.5 - 4.5)) = " + e);
    }

}
